article/qrcode-decoder-by-javascript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-10 Wed 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 JavaScript 解析二维码</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">使用 JavaScript 解析二维码</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org69aefa0">1. ngx-qrcode-all</a>
<ul>
<li><a href="#org9da01f6">1.1. 安装</a></li>
<li><a href="#org8ffe538">1.2. 使用</a></li>
</ul>
</li>
<li><a href="#orgc28f4a3">2. qrcode-parser</a>
<ul>
<li><a href="#orgca03c1d">2.1. 安装</a></li>
<li><a href="#org0864e5c">2.2. 使用</a></li>
</ul>
</li>
<li><a href="#org9895c87">3. ngx-qrcode2</a>
<ul>
<li><a href="#org72e50d9">3.1. 安装</a></li>
<li><a href="#orgb539a08">3.2. 使用</a></li>
</ul>
</li>
<li><a href="#org49fa78c">4. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org69aefa0" class="outline-2">
<h2 id="org69aefa0"><span class="section-number-2">1</span> ngx-qrcode-all</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9da01f6" class="outline-3">
<h3 id="org9da01f6"><span class="section-number-3">1.1</span> 安装</h3>
<div class="outline-text-3" id="text-1-1">
<p>
直接使用 yarn 安装
</p>
<div class="org-src-container">
<pre class="src src-sh">yarn add ngx-qrcode-all
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ffe538" class="outline-3">
<h3 id="org8ffe538"><span class="section-number-3">1.2</span> 使用</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Appmodule 中导入模块
</p>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> NgModule <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'@angular/core'</span>;
<span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> CommonModule <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'@angular/common'</span>;
<span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> QrCodeAllModule <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'ngx-qrcode-all'</span>;
<span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> AppComponent <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'./app.component'</span>;

@NgModule<span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span>
    imports: <span style="color: #9564bf;">[</span>
        CommonModule,
        QrCodeAllModule
    <span style="color: #9564bf;">]</span>,
    declarations: <span style="color: #9564bf;">[</span>
        AppComponent
    <span style="color: #9564bf;">]</span>
<span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">export</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">AppModule</span> <span style="color: #8d5649;">{</span>
    <span style="color: #859900;">constructor</span><span style="color: #d8241f;">()</span> <span style="color: #d8241f;">{}</span>
<span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
情况一： 生成二维码的代码模板
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #b58900;">div</span> <span style="color: #6c71c4;">id</span>=<span style="color: #2aa198;">"qrcodeid"</span>&gt;
 &lt;<span style="color: #b58900;">qr-code-all</span> [qrCodeType]=<span style="color: #2aa198;">"url"</span>
     [qrCodeValue]=<span style="color: #2aa198;">"'SK is the best in the world!'"</span>
     [qrCodeVersion]=<span style="color: #2aa198;">"'1'"</span>
     [qrCodeECLevel]=<span style="color: #2aa198;">"'M'"</span>
     [qrCodeColorLight]=<span style="color: #2aa198;">"'#ffffff'"</span>
     [qrCodeColorDark]=<span style="color: #2aa198;">"'#000000'"</span>
     [width]=<span style="color: #2aa198;">"11"</span>
     [margin]=<span style="color: #2aa198;">"4"</span>
     [scale]=<span style="color: #2aa198;">"4"</span>
     [scanQrCode]=<span style="color: #2aa198;">"false"</span>&gt;
 &lt;/<span style="color: #b58900;">qr-code-all</span>&gt;
&lt;/<span style="color: #b58900;">div</span>&gt;
</pre>
</div>

<p>
情况二： 读取二维码的代码模板
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #b58900;">div</span> <span style="color: #6c71c4;">id</span>=<span style="color: #2aa198;">"qrcodeid"</span>&gt;
 &lt;<span style="color: #b58900;">qr-code-all</span> [canvasWidth]=<span style="color: #2aa198;">"640"</span>
     [canvasHeight]=<span style="color: #2aa198;">"480"</span>
     [debug]=<span style="color: #2aa198;">"false"</span>
     [stopAfterScan]=<span style="color: #2aa198;">"true"</span>
     [updateTime]=<span style="color: #2aa198;">"500"</span>
     (onCapture)=<span style="color: #2aa198;">"captureImage($event)"</span>
     [scanQrCode]=<span style="color: #2aa198;">"true"</span>&gt;
 &lt;/<span style="color: #b58900;">qr-code-all</span>&gt;
&lt;/<span style="color: #b58900;">div</span>&gt;
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgc28f4a3" class="outline-2">
<h2 id="orgc28f4a3"><span class="section-number-2">2</span> qrcode-parser</h2>
<div class="outline-text-2" id="text-2">
<p>
一个没有依赖的二维码前端解析工具。优点是比较轻量级，缺点是不会调用摄像头，需要
编写调用摄像头的代码。
</p>
</div>

<div id="outline-container-orgca03c1d" class="outline-3">
<h3 id="orgca03c1d"><span class="section-number-3">2.1</span> 安装</h3>
<div class="outline-text-3" id="text-2-1">
<p>
使用 qrcode-parser 包来解析二维码。直接使用 yarn 安装
</p>
<div class="org-src-container">
<pre class="src src-sh">yarn add qrcode-parser
</pre>
</div>
</div>
</div>

<div id="outline-container-org0864e5c" class="outline-3">
<h3 id="org0864e5c"><span class="section-number-3">2.2</span> 使用</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #859900;">import</span> qrcodeParser from <span style="color: #2aa198;">'qrcode-parser'</span>;

<span style="color: #859900;">var</span> <span style="color: #6c71c4;">imageUrl</span> = <span style="color: #2aa198;">''</span>;

qrcodeParser(imageUrl).then(res =&gt; {
  document.getElementById(<span style="color: #2aa198;">'content'</span>).innerText = res.data
})

<span style="color: #859900;">const</span> <span style="color: #6c71c4;">fileElement</span> = document.getElementById(<span style="color: #2aa198;">'file'</span>)
fileElement.addEventListener(<span style="color: #2aa198;">'change'</span>, () =&gt; {
  <span style="color: #859900;">const</span> <span style="color: #6c71c4;">file</span> = fileElement.files[0]
  qrcodeParser(file).then(res =&gt; {
    document.getElementById(<span style="color: #2aa198;">'content'</span>).innerText = res.data
  })
}, <span style="color: #268bd2;">false</span>)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9895c87" class="outline-2">
<h2 id="org9895c87"><span class="section-number-2">3</span> ngx-qrcode2</h2>
<div class="outline-text-2" id="text-3">
<p>
一个集成到 angular 的二维码生成工具。只能生成，不能读取。
</p>
</div>

<div id="outline-container-org72e50d9" class="outline-3">
<h3 id="org72e50d9"><span class="section-number-3">3.1</span> 安装</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sh">yarn add ngx-qrcode2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb539a08" class="outline-3">
<h3 id="orgb539a08"><span class="section-number-3">3.2</span> 使用</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Appmodule 中导入模块
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> BrowserModule <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'@angular/platform-browser'</span>;
<span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> NgModule <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'@angular/core'</span>;
<span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> NgxQRCodeModule <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'ngx-qrcode2'</span>;

<span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> AppComponent <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'./app.component'</span>;

@NgModule<span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span>
  declarations: <span style="color: #9564bf;">[</span>
    AppComponent
  <span style="color: #9564bf;">]</span>,
  imports: <span style="color: #9564bf;">[</span>
    BrowserModule,
    NgxQRCodeModule
  <span style="color: #9564bf;">]</span>,
  providers: <span style="color: #9564bf;">[]</span>,
  bootstrap: <span style="color: #9564bf;">[</span>AppComponent<span style="color: #9564bf;">]</span>
<span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">export</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">AppModule</span> <span style="color: #8d5649;">{</span> <span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
app.component.html 插入的模板
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #b58900;">div</span> <span style="color: #6c71c4;">style</span>=<span style="color: #2aa198;">"text-align:center"</span>&gt;
  &lt;<span style="color: #b58900;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">ngx-qrcode2 demo</span>&lt;/<span style="color: #b58900;">h1</span>&gt;
&lt;/<span style="color: #b58900;">div</span>&gt;

&lt;<span style="color: #b58900;">ngx-qrcode</span>
      [qrc-element-type]=<span style="color: #2aa198;">"elementType"</span>
      [qrc-value] = <span style="color: #2aa198;">"value"</span>
      qrc-class = <span style="color: #2aa198;">"aclass"</span>
      qrc-errorCorrectionLevel = <span style="color: #2aa198;">"L"</span>&gt;
&lt;/<span style="color: #b58900;">ngx-qrcode</span>&gt;
</pre>
</div>

<p>
app.component.ts 中添加代码
</p>

<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #859900;">import</span> <span style="color: #8d5649;">{</span> Component <span style="color: #8d5649;">}</span> <span style="color: #859900;">from</span> <span style="color: #2aa198;">'@angular/core'</span>;

@Component<span style="color: #8d5649;">(</span><span style="color: #d8241f;">{</span>
  selector: <span style="color: #2aa198;">'app-root'</span>,
  templateUrl: <span style="color: #2aa198;">'./app.component.html'</span>,
  styleUrls: <span style="color: #9564bf;">[</span><span style="color: #2aa198;">'./app.component.css'</span><span style="color: #9564bf;">]</span>
<span style="color: #d8241f;">}</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">export</span> <span style="color: #859900;">class</span> <span style="color: #268bd2;">AppComponent</span> <span style="color: #8d5649;">{</span>
  title = <span style="color: #2aa198;">'app'</span>;
  elementType = <span style="color: #2aa198;">'url'</span>;
  value = <span style="color: #2aa198;">'Techiediaries'</span>;
<span style="color: #8d5649;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org49fa78c" class="outline-2">
<h2 id="org49fa78c"><span class="section-number-2">4</span> 参考链接</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://github.com/sinchang/qrcode-parser">qrcode-parser</a>: A pure javascript QR code reading library, accept File object, image url, base64.</li>
<li><a href="https://qrcode-parser.netlify.com/">qrcode parser live demo</a></li>
<li><a href="https://github.com/nileskh16/ngx-qrcode-all">ngx-qrcode-all</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2019-07-10 Wed 15:07. Created by Jinghui Hu at 2018-10-11 Thu 11:04.</p>
</div>
</body>
</html>
